words/dotfiles_initialcommit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>dotfiles_initialcommit</title>
<!-- 2017-07-31 Mon 12:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="mobyte" />
</head>
<body>
<div id="content">
<h1 class="title">dotfiles_initialcommit</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. dotfiles - Initial Commit</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> dotfiles - Initial Commit</h2>
<div class="outline-text-2" id="text-1">
<p>
By this point, I've used emacs for maybe about 1.5 years. Aside from that, I've used \*nix for some time now, maybe 8 years? Hard to tell, but to put a long story short, let's talk about <b>dotfiles</b>.
</p>

<p>
To configure emacs and the other \*nix tools I use, using these dotfiles makes it a lot easier to have the same setup across multiple computers. For whatever reason, I've just been using some awful method of copy-pasting snippets through Dropbox. Time to put an end to that and make my setup across multiple machines more consistent. In order to set up this repository, I'm using GitHub to hold my repository for the time being and I'm using GNU Stow to manage the dotfiles themselves.
</p>

<p>
Explaining GNU Stow at this point is just overdoing it since there are <i>plenty</i> of resources out there for explaining this method. In a nutshell, all I have done is I have created a dotfiles directory in my <code>~</code> directory and then GNU Stow creates links to them in my <code>~</code>.
</p>

<p>
I've just started using GNU Stow recently, so I don't know all about its functionality yet. However, at a basic level, I am able to type <code>$ stow emacs</code> inside my dotfiles directory and then it will link the <code>.emacs.d</code> directory to my <code>~</code> for me. Then after that, I have just wrapped it all wrapped up with git. This should hopefully help me keep track of any changes.
</p>

<p>
The main reason I've set up this repository is because my emacs configuration has become a little messy. After the experience I've had with the many emacs packages and what spacemacs has to offer, I'm going to start with a new configuration from scratch and I'll see what I can come up with. Additionally, while using MELPA has been handy in helping me install new packages easily, I'm going to try using packages from source this time around to see if I enjoy the experience more.
</p>

<p>
The current version of my dotfiles repository holding emacs holds some of my essential configurations and packages. Some of the packages I have now include <code>helm</code>, <code>nlinum</code>, <code>smart-tabs-mode</code>, <code>magit</code>, and some preferred color themes. Some of the defaults I have set are to show line numbers, a more minimal interface, and setting up indentation. Really basic stuff. We'll see how it goes later as I keep tweaking things.
</p>

<p>
So basically, here are some ideas for the dotfiles that I want to set up:
</p>

<pre class="example">
~/.emacs.d/              - to hold my emacs config and lisp packages
~/.config/fish/          - for fish configuration and aliases
~/.Xresources            - color themes
~/.nano/                 - nano configuration, used as a backup for when emacs isn't available
~/.startpage/            - browser start page links
~/.wallpaper/            - desktop wallpaper images
~/.tmux/                 - tmux configurations
~/.config/ranger/        - ranger configurations, set up to use emacs keybindings
~/.git/                  - global ignores, other git stuff
~/.config/neofetch/      - neofetch preset
~/.scrot/                - screenshots
~/.scripts/              - useful scripts
~/.iterm/                - iterm configurations for macos
</pre>

<p>
I'll probably also eventually see about setting up a music player configuration, so that should come later. For now, at the time of writing this, the commit in my dotfiles repository is <code>f6093b6bc3e6b73610cb3e75e0a11e923bf7f1ac</code> and it can be found <a href="https://github.com/mobyte0/dotfiles">on GitHub</a>.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2017-06-26 Mon]</span></span>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mobyte</p>
<p class="date">Created: 2017-07-31 Mon 12:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
